content/Life/Dating_Openly_Challanges.md
+++
title = "Poly Dating"
author = ["Josh Rollins"]
publishDate = 2018-11-14T00:00:00-05:00
lastmod = 2018-12-03T22:27:51-05:00
draft = true
+++

Last night I browsed Reddit, which is my much-adequate replacement for Facebook and the [now-officially-dead Google Plus](https://www.nytimes.com/2018/10/08/technology/google-plus-security-disclosure.html). A post that captured my eye was "[For the record—it’s way easier to get a date with a man than with a woman](https://www.reddit.com/r/polyamory/comments/9wozci/for%5Fthe%5Frecordits%5Fway%5Feasier%5Fto%5Fget%5Fa%5Fdate%5Fwith%5Fa/)" in the Polyamory subreddit.

I feel I can summarize the post in this statement the OP (original poster) made:

"Ive been using several apps, some of which (like 'Her') are women-only. What I’ve come to discover is that most women are EXTREMELY passive on dating apps." She is a bisexual 29 year old female.

My intension here is not to commet directly about the post itself (or the many comments under it it), but instead talk about my own experience as a CIS non-monogamous man nearing his 40s.


## Age {#age}

It seems that women who are living a healthy polyamorous lifestyle after 35 are extremly rare when compared to women in their 20s and even early 30s. Most women that I talk to are looking for something "serious" and "long lasting," which from their definition would mean a monogamous, long-term relationship that would at least lead in the direction of marriage.

Even on Tinder, an app that is assumed to be more for hooking up and not for settling down, this pattern is very clear. Most women evaporate (they suddenly disapear from the app on my end altogether, which implies I'm being blocked) as soon as they understand I am a non-monogamist. This understanding comes, on Tinder at least, when they take the time to look at my profile (it's the first line) or when I explain it. We can sometimes have a converstion that extands to texts for a day or two, and then suddenly not a word when the understand of what the term means hits them. This last example is rare, but it happens; what important to note is that there's an extremly small portion of women who would carry on a conversation after what me (and other poly folks) call "drop the poly bomb".

On OKCupid, the crowd generally is more careful with profiles. Even then though, women who would match up well with me (92% and above) would often describe non-monogamy as not something they personally appose to, but at the same time, not for them. OKC has altarted its dating filtering to cater better for non-monogamous folks a couple of times. There "seeing someone" relationship status for those who date openly has been around for a while. More recently, the site made the realtionship status stand out more, making it easier to find people who marked their profile as "non-monogmaous". Still though, the number of women who mark themselves as non-monogmous in NYC is fairely small in my age group. I am not sure how much my own profile filters some due to low percentage, but I doubnt the imapct is so large that only one profile in about 10 shows as non-monogamous.

It's important to mention that I did not bother with all these details in the past. It seemed that women in general were much more willing to experiment, try new things, and date. Many times (but not always) this meant sexually. I think it's worth mentioning here that some of these women became friends even after we stopped dating romantically. I'm in touch with them to this day. If I am to guess (which is all I can do, this is my theory) I would say this has to do with what women (in general) are brought up to believe and, unfortuantely, "trained" for. Others still are looking for a "primary" partner who would treat them as the main anchor in the relationship and consider anyone else "seconadry." To me, this is not polyamory as much as it is a "reformed" monogamy of sorts. Many would appose, of course. To each their own.


## Priorities and Specifics {#priorities-and-specifics}

Another important aspect is diciplines of life at this point. For many, me including, work takes a large chunk of time. For the most part, I like it this way. I am passionate about my job and the passion often bleeds into my personal life. People who are passionate about what they do is important in dating. From my experience, when I date women who love what they do, it shows in everything.

It so follows that women I want to date have similar priorities. In turn this leads to challanges, such as time managment, proximity (sometimes down to block radious in the city), certain amount of wealth, education and more. While I often feel I must be more flexible about my priorites, it seems the women I talk to do not. This is a simple case of supply and demand. I've talked to several women and I know that comparing my OKC inbox to theirs would be like comparing a flower in a pot in your living room to a meddow full vagitation, including the unwanted weed that grows everywhere.

I have previously asked in the polyamory reddit for advice from women regarding how to reach to more of them. I was positively surprised at the amount of comments I recieved: most women who responded mentioned that the big issue is time and commitment. In other words, the fact that I'm busy with work and already have fulltime partners mean that I have little time for a new partner. That would be very true if the women I speak to would _know_ I have two full time partners and that I am very busy, but generally, they do not My profile specifies that I'm a non-monogmaous and generally busy, but I stay away from details until asked later. There's no reference to my partners and my relationship with them. This is not because I hide this information (I would gladly talk about it with a person I date), but because my partners have their own private lives as well, and my dating profile is not and should not be tied to them.

However, In the past I used to connect to my partners' profile, and that made little to no difference. I found then that most women would not read as far into the profile to get to these details. They would just message me, curious about polyamory in general. I would often find myself in a position of explaining what it is and how it works. Times have changed.


## Mainstream {#mainstream}

When I started dating as a non-monogamist, polyamory was a magical word. It was a term wispered at dark bars after a BDSM party died down, speaking of "another way" and a "lifestyle" that was never explained thoroughly. It would also be a term you would not dare mention for fear of being discovered at work and in the family. For some, this is still true, but the number is lowering every day.

We live in a different world now. Polyamory is a term that officially exists in dating apps and TV shows. The number of people who haven't heard of it before is decreasing fast. The good side of this is that we can talk about it, we can make it better, we don't need to be afraid of being judged and even have the power to take countermeasures if we are descriminated against.

But the other part of going mainstream is the flatness. Polyamory is so common of a term now that it's being thrown around without care, and (in my opinion) without full understanding of what it means individually to each person. Where once you got the stage to discuss what polyamory means to you as a person over a drink with a facinated date, now you find that the person at the other side of the table, who sometimes never paracticed polyamory fully, already knows what polyamory is. Oh yes, they have a full definition, tied to judgment and a plan of action, just because you mention the word. You don't get to explain, they explain it _to you_.

What is left is often to shake my head and turn my back. There's no talking to a wall, or a glass that is already full, as the famous zen saying goes. When I meet someone who flat out insist they don't  want to be a "unicorn" or a "secondary" or (worst of all) a cheating secret without the patience to listen, I just walk away. I tried to talk some sense into these people, but I stopped wasting my time. It never ends well.


## Attraction {#attraction}

Physical attraction is a big factor. I find it funny  how far we go out of our way sometimes not to mention this. It would seem we are so careful not to hurt anyone's feelings, and by doing so we hurt oursevles in the long run.

The fact is, I don't find most of the women who are interested in me online attractive. There's hardly anything new or weird about this statement when you think about, yet, it just sounds so _bad_. Why is that?

I do not think I have high standards. I am not attracted to obese women, though in some cases overwight is OK. I think [WHO's BMI calculations](http://www.who.int/en/news-room/fact-sheets/detail/obesity-and-overweight) is overall a pretty good guide for what I call overweight, if you're curious. I've tried to force myself to date obese and overwight women before and ended up being miserable, or made them misrable as a result. the temption, due to despair, can be overwhelming at times.

Other factors that go into attraction for me include less body hair in general, but I do not have any hard lines here. Smell and hygine are important to me. That's mostly it. It seems the women I date have far stricter requierments in this area, but I wouldn't know for sure. This is not often discussed as I hope it would,  even if I ask directly. My conclusion then is based on what I see on profiles, comments such as "please be fit," or "only groomed beards" and the like. Among the more hidden features (those are the kind that are not posted on the profile or discussed openely, sometimes never) the height issue seems to be a big deal: Most women want their partner to be taller than they are.

I've dated a tall woman once who, after a few months and a couple of sexual intercourses, finally came to the conclusion that the height differene _does_ in fact bothers her. She was somewhat surprised herself, it was a discovery she has made and shared with me. We have developed a friendship strong enough by then to respect one another to admit such things (we still are friends). She mentioned that the real realizion was not the fact that the height difference bothered her; it was the fact that she had _resisted_ acknologing it is such a big deal for so long. She saw herself as accepting and open minded, and having a problem with a height was betraying this image of herself. In other words, she wouldn't allow herself to admint she is not attracted to shorter men.

For calrification, I'm 5'6''. Definitely not the tallest out there, but there are many women my height or lower. This was never a real problem, I'm using it here as an example for a hidden feature as I explained earlier.


## Sex {#sex}

Finally I want to address sex _means_. Most of us date with sex on the mind, to one degree or another. Of course there are asexual folks and those who use dating apps to create stirctly social connections, but in general this is rare. For a long time, I struggeld with the fact of bringing sex up on my profile. I have a somewhat of a BDSM background, and I'm not new to what is generally considered "kinky" sex. What this means, interestingly, is that I often bring sex up as a conversation topic. Because this is a personal and sensitive issue, I would ask a permission first, and naturally, I need to be comfortable myself. This doesn't usually happen on the first date, but it can.

As an average CIS male (whatever average means), it seems I usually crave sex more often then those I date. However, it seems women crave sex just as much but are hold back from bringing it up. This ties to a familiar pattern of what wanting sex means to a woman, or, as a friend of mine would often say when I talk to her, what it still unfortunately means to women to "admit" wanting sex. I strongly agree that we still judge women who openly seek sex too harshly, but for now, this reality means most women won't be comfortable discussing sex opently before we get intimate, which in my opinion, is a disadventage. I should also mention that there are women who offer sex (or sexual connection) right off the bat, basically the equivilant of "dick pictures" just with female parts. In each case this happened to me, the woman is desperate and unattractive - physically or mentally.

When I was more involved in the "kink scene," sex was everywhere, and therefor, it was nowhere. Everyone had nude pictures on their profile and tell you what gets them off if you'd ask (with permission, of course). I found this libarating. I could know how someone would look like under their clothes and thus very simple to get laid if the interest was mutual. Interistingly though, usually there was _less_ of rush to get there.  You both knew what was down there, you both knew you want to get here eventually, so you both ended up getting a drink and talking it over and build something that would _include_ rather than lead to sex.

Unfortnately I since stopped being as active. Partly due to time constraints, but mostly due to age. Many of these groups are strongly enfourced by an age limit that wouldn't allow a man my age to join a group of people in their 20s, for example. This is a good rule, and is there for a good reason. Work is often another thing that gets in the way, especially if you like what you do. It's just not as appealing to be an hour late and show up with a hangover to work. Been there, done that, no thank you kind of deal.

In my opinion, Sex and its meaning is something we should definitely talk about more openly. If it's not on the table, which often means end of dating, so be it. If it is under certain understandings as it often is, it should be discussed. It is a topic that often disappears into a lingering question mark. Some like to call this a tease, but I don't. Teasing, I believe, is something that happens _after_ people are comfortable enough to put sex on the table. Otherwise, why waste feelings and time? Even at times where we're not sure sex will take place (this happens to me often enough), it is fine to say so. Something like "look, I don't want to get your hopes up, I'm just not sure yet. Can we take it easy one more time or two?" is perfectly fine. If it isn't, you'd better go look for someone else. I would.


## Where are we {#where-are-we}

At this point in my life, dating people is at it's hardest. The only time in my life I recall dating being as challanging was my early 20s, where I was still a clueless virgin who tried to do everything "by the book." Life had different plans, as it often does, and I ended up the complete opposite direction which thankfully shocked me out of that stupid daze.

I am a consitant person, and I belive in keeping on trying a forumla that generally works. This is what I intend to keep on doing. One of the things I know I should start doing again though is turning back to the kink scene and find positive people in it. That has been the best becon in the past, and I believe it could once again in the future.